In [1]:
import pandas as pd

In [2]:
from pandas import Series,DataFrame

In [3]:
obj = pd.Series([4,7,-5,3])

In [4]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = pd.Series([4,7,-5,3],index = ['d','b','a','c'])

In [8]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [9]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [10]:
obj2['a']

-5

In [11]:
obj2['d'] = 6

In [12]:
obj2[['c','a','d']]

c    3
a   -5
d    6
dtype: int64

In [13]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [14]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [15]:
import numpy as np
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [16]:
'b' in obj2

True

In [17]:
'e' in obj2

False

In [18]:
sdata = {'Ohio':35000,'Texas':71000,'Oregon':16000,'Utah':5000}

In [19]:
obj3 = pd.Series(sdata)

In [20]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [21]:
states = ['Califrornia','Ohio','Oregon','Texas']

In [22]:
obj4 = pd.Series(sdata,index = states)

In [23]:
obj4

Califrornia        NaN
Ohio           35000.0
Oregon         16000.0
Texas          71000.0
dtype: float64

In [24]:
pd.isnull(obj4)

Califrornia     True
Ohio           False
Oregon         False
Texas          False
dtype: bool

In [25]:
pd.notnull(obj4)

Califrornia    False
Ohio            True
Oregon          True
Texas           True
dtype: bool

In [26]:
obj4.isnull()

Califrornia     True
Ohio           False
Oregon         False
Texas          False
dtype: bool

In [27]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [28]:
obj4

Califrornia        NaN
Ohio           35000.0
Oregon         16000.0
Texas          71000.0
dtype: float64

In [29]:
obj3+obj4

Califrornia         NaN
Ohio            70000.0
Oregon          32000.0
Texas          142000.0
Utah                NaN
dtype: float64

In [30]:
obj4.name = 'population'

In [31]:
obj4.index.name = 'state'

In [32]:
obj4

state
Califrornia        NaN
Ohio           35000.0
Oregon         16000.0
Texas          71000.0
Name: population, dtype: float64

In [33]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [34]:
obj.index = ['Bob','Steve','Jeff','Ryan']

In [35]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [36]:
data = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
       'year':[2000,2001,2002,2001,2002,2003],
       'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}
frame = pd.DataFrame(data)

In [37]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [38]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [39]:
pd.DataFrame(data,columns = ['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [40]:
frame2 = pd.DataFrame(data,columns = ['year','state','pop','debt'],
                      index = ['one','two','three','four','five','six'])

In [41]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [42]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [43]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [44]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [45]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [46]:
frame2['debt'] = 16.5

In [47]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [48]:
frame2['debt'] = np.arange(6.)

In [49]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [50]:
val = pd.Series([-1.2,-1.5,-1.7],index = ['two','four','five'])

In [51]:
frame2['debt'] = val

In [52]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [53]:
frame2['eastern'] = frame2.state == 'Ohio'

In [54]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [55]:
del frame2['eastern']

In [56]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [57]:
pop = {'Nevada':{2001:2.4,2002:2.9},
      'Ohio':{2000:1.5,2001:1.7,2002:3.6}}

In [58]:
frame3 = pd.DataFrame(pop)

In [59]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [60]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [61]:
pd.DataFrame(pop,index = [2001,2002,2003],columns=['Nevada','Ohio'])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [62]:
pdata = {'Ohio':frame3['Ohio'][:-1],'Nevada':frame3['Nevada'][:2]}

In [63]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [64]:
frame3.index.name = 'year';frame3.columns.name = 'state'

In [65]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [66]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [67]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

In [68]:
obj = pd.Series(range(3),index = ['a','b','c'])

In [69]:
index = obj.index

In [70]:
index

Index(['a', 'b', 'c'], dtype='object')

In [71]:
index[1:]

Index(['b', 'c'], dtype='object')

In [72]:
labels = pd.Index(np.arange(3))

In [73]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [74]:
obj2 = pd.Series([1.5,-2.5,0],index = labels)

In [75]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [76]:
obj2.index is labels

True

In [77]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [78]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [79]:
'Ohio' in frame3.columns

True

In [80]:
2003 in frame3.index

False

In [81]:
dup_labels = pd.Index(['foo','foo','bar','bar'])

In [82]:
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [83]:
obj = pd.Series([4.5,7.2,-5.3,3.6],index = ['d','b','a','c'])

In [84]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [85]:
obj2 = obj.reindex(['a','b','c','d','e'])

In [86]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [87]:
obj3 = pd.Series(['blue','purple','yellow'],index = [0,2,4])

In [88]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [89]:
obj3.reindex(range(6) ,method = 'ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [90]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)),
                    index = ['a','b','c'],
                    columns = ['Ohio','Texas','California'])

In [91]:
frame

   Ohio  Texas  California
a     0      1           2
b     3      4           5
c     6      7           8

In [92]:
frame2 = frame.reindex(['a','b','c','d'])

In [93]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   3.0    4.0         5.0
c   6.0    7.0         8.0
d   NaN    NaN         NaN

In [94]:
states = ['Texas','Utah','California']

In [95]:
frame.reindex(columns = states)

   Texas  Utah  California
a      1   NaN           2
b      4   NaN           5
c      7   NaN           8

In [96]:
obj = pd.Series(np.arange(5.),index = ['a','b','c','d','e'])

In [97]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [98]:
new_obj = obj.drop('c')

In [99]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [100]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [101]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                   index = ['Ohio','Colorado','Utah','New York'],
                   columns = ['one','two','three','four'])

In [102]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [103]:
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [104]:
data.drop('two',axis = 1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [105]:
data.drop(['two','four'],axis = 'columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [106]:
obj.drop('c',inplace = True)

In [107]:
obj = pd.Series(np.arange(4.),index = ['a','b','c','d'])

In [108]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [109]:
obj['b']

1.0

In [110]:
obj[1]

1.0

In [111]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [112]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [113]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [114]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [115]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [116]:
obj['b':'c'] = 5

In [117]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [118]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                   index = ['Ohio','Colorado','Utah','New York'],
                   columns = ['one','two','three','four'])

In [119]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [120]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [121]:
data[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [122]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [123]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [124]:
data <5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [125]:
data[data < 5] = 0

In [126]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [127]:
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [128]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [129]:
data.iloc[[1,2],[3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [130]:
data.iloc[:,:3][data.three >5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [131]:
ser = pd.Series(np.arange(3.))

In [132]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [133]:
ser2 = pd.Series(np.arange(3.),index = ['a','b','c'])

In [134]:
ser2[-1]

2.0

In [135]:
ser[:1]

0    0.0
dtype: float64

In [136]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [137]:
ser.iloc[:1]

0    0.0
dtype: float64

In [138]:
s1 = pd.Series([7.3,-2.5,3.4,1.5],index = ['a','c','d','e'])

In [139]:
s2 = pd.Series([-2.1,3.6,-1.5,4,3.1],
               index = ['a','c','e','f','g'])

In [140]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [141]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [142]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [143]:
df1 = pd.DataFrame(np.arange(9.).reshape((3,3)),
                  columns = list('bcd'),
                   index = ['Ohio','Texas','Colorado'])

In [144]:
df2 = pd.DataFrame(np.arange(12.).reshape((4,3)),
                  columns = list('bde'),
                   index = ['Utah','Ohio','Texas','Oregon'])

In [145]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [146]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [147]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [148]:
df1 = pd.DataFrame({'A':[1,2]})

In [149]:
df2 = pd.DataFrame({'B':[3,4]})

In [150]:
df1

   A
0  1
1  2

In [151]:
df2

   B
0  3
1  4

In [152]:
df1-df2

    A   B
0 NaN NaN
1 NaN NaN

In [153]:
df1+df2

    A   B
0 NaN NaN
1 NaN NaN

In [154]:
df1 = pd.DataFrame(np.arange(12.).reshape((3,4)),
                  columns = list('abcd'))

In [155]:
df2 = pd.DataFrame(np.arange(20.).reshape((4,5)),
                  columns = list('abcde'))

In [156]:
df2.loc[1,'b'] = np.nan

In [157]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [158]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [159]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [160]:
df1.add(df2,fill_value = 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [161]:
1 / df1

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

In [162]:
df1.rdiv(1)#同上

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

In [163]:
df1.reindex(columns = df2.columns,fill_value = 0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [164]:
arr = np.arange(12.).reshape((3,4))

In [165]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [166]:
arr[0]

array([0., 1., 2., 3.])

In [167]:
arr-arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [168]:
frame = pd.DataFrame(np.arange(12.).reshape((4,3)),
                    columns = list('bde'),
                    index = ['Utah','Ohio','Texas','Oregon'])

In [169]:
series = frame.iloc[0]

In [170]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [171]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [172]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [173]:
series2 = pd.Series(range(3),index = ['b','e','f'])

In [174]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [175]:
series3 = frame['d']

In [176]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [177]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [178]:
frame.sub(series3,axis = 'index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [179]:
frame = pd.DataFrame(np.random.randn(4,3),
                    columns = list('bde'),
                    index = ['Utah','Ohio','Texas','Oregon'])

In [180]:
frame

               b         d         e
Utah   -0.196521 -0.509092  0.157409
Ohio   -0.158753 -1.636194 -0.268362
Texas   0.302410  1.604383  0.916216
Oregon -1.058135 -1.127171  0.633591

In [181]:
np.abs(frame)

               b         d         e
Utah    0.196521  0.509092  0.157409
Ohio    0.158753  1.636194  0.268362
Texas   0.302410  1.604383  0.916216
Oregon  1.058135  1.127171  0.633591

In [182]:
f = lambda x :x.max()-x.min()

In [183]:
frame.apply(f)

b    1.360545
d    3.240577
e    1.184578
dtype: float64

In [184]:
frame.apply(f,axis = 'columns')

Utah      0.666501
Ohio      1.477441
Texas     1.301973
Oregon    1.760762
dtype: float64

In [185]:
def f(x):
    return pd.Series([x.min(),x.max()],index = ['min','max'])

In [186]:
frame.apply(f)

            b         d         e
min -1.058135 -1.636194 -0.268362
max  0.302410  1.604383  0.916216

In [187]:
format = lambda x : '%.2f' %x

In [188]:
frame.applymap(format)

            b      d      e
Utah    -0.20  -0.51   0.16
Ohio    -0.16  -1.64  -0.27
Texas    0.30   1.60   0.92
Oregon  -1.06  -1.13   0.63

In [189]:
frame['e'].map(format)

Utah       0.16
Ohio      -0.27
Texas      0.92
Oregon     0.63
Name: e, dtype: object

In [190]:
obj = pd.Series(range(4),index = ['d','a','b','c'])

In [191]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [192]:
frame = pd.DataFrame(np.arange(8).reshape((2,4)),
                    index = ['three','one'],
                    columns = ['d','a','b','c'])

In [193]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [194]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [195]:
frame.sort_index(axis=1,ascending = False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [196]:
obj = pd.Series([4,7,-3,2])

In [197]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [198]:
obj = pd.Series([4,np.nan,7,np.nan,-3,2])

In [199]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [200]:
frame = pd.DataFrame({'b':[4,7,-3,2],'a':[0,1,0,1]})

In [201]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [202]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [203]:
frame.sort_values(by=['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [204]:
obj = pd.Series([7,-5,7,4,2,0,4])

In [205]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [206]:
obj.rank(method = 'first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [207]:
#Assing tie values the maximum rank in the group

In [208]:
obj.rank(ascending = False,method = 'max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [209]:
frame = pd.DataFrame({'b':[4.3,7,-3,2],'a':[0,1,0,1],'c':[-2,5,8,-2.5]})

In [210]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [211]:
frame.rank(axis = 'columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [212]:
obj = pd.Series(range(5),index = ['a','a','b','b','c'])

In [213]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [214]:
obj.index.is_unique

False

In [215]:
obj['a']

a    0
a    1
dtype: int64

In [216]:
obj['c']

4

In [217]:
df = pd.DataFrame(np.random.randn(4,3),index = ['a','a','b','b'])

In [218]:
df

          0         1         2
a  1.823117 -0.870720  1.124469
a  1.286798 -0.324095  0.451075
b  1.203167  0.052758  2.531832
b  0.548849 -1.075222  0.375486

In [219]:
df.loc['b']

          0         1         2
b  1.203167  0.052758  2.531832
b  0.548849 -1.075222  0.375486

In [220]:
df = pd.DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]],index = ['a','b','c','d'],columns = ['one','two'])

In [221]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [222]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [223]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [224]:
df.mean(axis = 'columns',skipna = False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [225]:
df.idxmax()

one    b
two    d
dtype: object

In [226]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [227]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [228]:
obj = pd.Series(['a','a','b','c'] * 4)

In [229]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [230]:
#跳过相关系数和协方差

In [231]:
#唯一值、值计数以及成员资格

In [232]:
obj = pd.Series(['c','a','d','a','a','b','b','c','c'])

In [233]:
unique = obj.unique()

In [234]:
unique

array(['c', 'a', 'd', 'b'], dtype=object)

In [235]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [236]:
pd.value_counts(obj.values,sort = False)

a    3
c    3
b    2
d    1
dtype: int64

In [237]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [238]:
mask = obj.isin(['b','c'])

In [239]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [240]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [241]:
to_match = pd.Series(['c','a','b','b','c','a'])

In [242]:
unique_vals = pd.Series(['c','b','a'])

In [243]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [244]:
data = pd.DataFrame({'Qu1':[1,3,4,3,4],'Qu2':[2,3,1,2,3],'Qu3':[1,5,2,4,4]})

In [245]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [246]:
result = data.apply(pd.value_counts).fillna(0)

In [247]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [248]:
#第6章  数据加载、存储于文件格式

In [249]:
df = pd.read_csv('examples/ex1.csv')

In [250]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [251]:
type(df)

pandas.core.frame.DataFrame

In [252]:
pd.read_table('examples/ex1.csv',sep = ',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [253]:
pd.read_csv('examples/ex2.csv',header = None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [254]:
pd.read_csv('examples/ex2.csv',names=['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [255]:
names = ['a','b','c','d','message']

In [256]:
pd.read_csv('examples/ex2.csv',names = names,index_col = 'message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [257]:
parsed = pd.read_csv('examples/csv_mindex.csv',index_col = ['key1','key2'])

In [258]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [259]:
list(open('examples/ex3.txt'))

['               A       B       C\n',
 'aaa     -0.264438 -1.026059 -0.615900\n',
 'bbb     0.927272 0.302904 -0.032399\n',
 'ccc     0.264273 -0.386314 -0.217601\n',
 'ddd     -0.871858 -0.348382 1.100491\n']

In [260]:
result = pd.read_table('examples/ex3.txt',sep = '\s+')

In [261]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.615900
bbb  0.927272  0.302904 -0.032399
ccc  0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [262]:
pd.read_csv('examples/ex4.csv',skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [268]:
result = pd.read_csv('examples/ex5.csv')

In [269]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [270]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [271]:
result = pd.read_csv('examples/ex5.csv',na_values=['null'])

In [272]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [277]:
sentinels = {'message':['foo','NA'],'something':['two']}

In [278]:
pd.read_csv('examples/ex5.csv',na_values = sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [279]:
pd.options.display.max_rows = 10

In [281]:
result = pd.read_csv('examples/ex6.csv')

In [282]:
result

         one       two     three      four key
0   0.219878  0.293847  0.983178  0.927319   L
1   0.219878  0.293847  0.983178  0.927319   L
2   0.219878  0.293847  0.983178  0.927319   L
3   0.219878  0.293847  0.983178  0.927319   L
4   0.219878  0.293847  0.983178  0.927319   L
..       ...       ...       ...       ...  ..
9   0.219878  0.293847  0.983178  0.927319   L
10  0.219878  0.293847  0.983178  0.927319   L
11  0.219878  0.293847  0.983178  0.927319   L
12  0.219878  0.293847  0.983178  0.927319   L
13  0.219878  0.293847  0.983178  0.927319   L

[14 rows x 5 columns]

In [284]:
pd.read_csv('examples/ex6.csv',nrows=5)

        one       two     three      four key
0  0.219878  0.293847  0.983178  0.927319   L
1  0.219878  0.293847  0.983178  0.927319   L
2  0.219878  0.293847  0.983178  0.927319   L
3  0.219878  0.293847  0.983178  0.927319   L
4  0.219878  0.293847  0.983178  0.927319   L

In [286]:
chunker = pd.read_csv('examples/ex6.csv',chunksize = 1000)

In [287]:
chunker

In [289]:
chunker = pd.read_csv('examples/ex6.csv',chunksize = 1000)
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(),fill_value=0)
tot = tot.sort_values(ascending = False)

In [290]:
tot[:10]

L    14.0
dtype: float64

In [291]:
data = pd.read_csv('examples/ex5.csv')

In [292]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [293]:
data.to_csv('examples/out.csv')

In [295]:
import sys

In [296]:
data.to_csv(sys.stdout,sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [297]:
data.to_csv(sys.stdout,na_rep = 'null')

,something,a,b,c,d,message
0,one,1,2,3.0,4,null
1,two,5,6,null,8,world
2,three,9,10,11.0,12,foo

In [298]:
data.to_csv(sys.stdout,index = False,columns = ['a','b','c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [300]:
dates = pd.date_range('1/1/2000',periods = 7)

In [301]:
ts = Series(np.arange(7),index = dates)

In [302]:
ts.to_csv('examples/tseries.csv')

In [304]:
import csv

In [305]:
f = open('examples/ex7.csv')

In [306]:
reader = csv.reader(f)

In [308]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [309]:
with open('examples/ex7.csv') as f:
    lines = list(csv.reader(f))

In [313]:
header , values = lines[0],lines[1:]

In [314]:
data_dict = {h:v for h,v in zip(header,zip (*values))}

In [315]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [334]:
tables = pd.read_html('examples/fdic_failed_bank_list.html')

In [335]:
len(tables)

1

In [336]:
failures = tables[0]

In [337]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [338]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [339]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

In [340]:
from lxml import objectify

In [341]:
path = 'datasets/mta_perf/Performance_MNR.xml'

In [342]:
parsed = objectify.parse(open(path))

In [343]:
root = parsed.getroot()

In [344]:
data = []

In [345]:
skip_fields = ['PARENT_SEQ','INDICATOR_SEQ','DESIRED_CHANGE','DECIMAL_PLACES']

In [346]:
for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        continue
    el_data[child.tag] = child.pyval
data.append(el_data)

In [347]:
perf = pd.DataFrame(data)

In [348]:
perf.head()

  MONTHLY_ACTUAL
0

In [349]:
from io import StringIO
tag = '<a href = "http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [350]:
root

In [351]:
root.get('href')

'http://www.google.com'

In [353]:
root.text

'Google'

In [354]:
frame = pd.read_csv('examples/ex1.csv')

In [355]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [356]:
frame.to_pickle('examples/frame_pickle')

In [357]:
pd.read_pickle('examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [358]:
frame = pd.DataFrame({'a':np.random.randn(100)})

In [359]:
store = pd.HDFStore('mydata.h5')

In [360]:
store['obj1'] = frame

In [361]:
store['obj1_col'] = frame['a']

In [362]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [363]:
store['obj1']

           a
0  -0.655993
1  -0.018722
2   0.709767
3  -0.828035
4  -2.294462
..       ...
95  1.069253
96  1.434664
97 -0.303344
98 -0.464775
99  1.158722

[100 rows x 1 columns]

In [364]:
store.put('obj2',frame,format = 'table')

In [365]:
store.select('obj2',where = ['index >= 10 and index <= 15' ])

           a
10 -0.086064
11  1.478500
12  0.182060
13 -1.432000
14 -0.002760
15 -1.364713

In [366]:
store.close()

In [367]:
frame.to_hdf('mydata.h5','obj3',format = 'table')

In [368]:
pd.read_hdf('mydata.h5','obj3',where = ['index < 5'])

          a
0 -0.655993
1 -0.018722
2  0.709767
3 -0.828035
4 -2.294462

In [369]:
xlsx = pd.ExcelFile('examples/ex1.xlsx')

In [370]:
pd.read_excel(xlsx,'Sheet1')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [371]:
frame = pd.read_excel('examples/ex1.xlsx','Sheet1')

In [372]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [373]:
writer = pd.ExcelWriter('examples/ex2.xlsx')

In [374]:
frame.to_excel(writer,'Sheet1')

In [375]:
writer.save()

In [376]:
frame.to_excel('examples/ex2.xlsx')

In [378]:
import requests

In [379]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [380]:
resp = requests.get(url)

In [381]:
resp

In [382]:
data = resp.json()

In [383]:
data[0]['title']

'Bug groupby idxmin'

In [384]:
issues = pd.DataFrame(data,columns = ['number','title','labels','state'])

In [386]:
issues

,number,title,labels,state
0,25531,Bug groupby idxmin,[],open
1,25529,fix segfault when running with cython coverage...,[],open
2,25528,DOC: Polishing typos out of doc/source/user_gu...,[],open
3,25527,Data dependent bug in mode aggregation,"[{'id': 307649777, 'node_id': 'MDU6TGFiZWwzMDc...",open
4,25526,DOC: Fixed PeriodArray api ref,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
...,...,...,...,...
25,25495,Unexpected dtype when using .loc to set Catego...,[],open
26,25488,Fix JSON orient='table' issues with numeric co...,"[{'id': 49379259, 'node_id': 'MDU6TGFiZWw0OTM3...",open
27,25484,BUG: User-facing AssertionError with add colum...,"[{'id': 42670965, 'node_id': 'MDU6TGFiZWw0MjY3...",open
28,25481,BUG: confusing error message for DataFrame.plot(),"[{'id': 42670965, 'node_id': 'MDU6TGFiZWw0MjY3...",open
29,25476,value_counts() counting wrong categories,[],open

In [411]:
import sqlite3

In [412]:
query = """
CREATE TABLE test
(a VARCHAR(20),b valchar(20),
c REAL, d INTEGER
);"""

In [413]:
con = sqlite3.connect('mydata.sqlite')

In [414]:
con.execute(query)

OperationalError: table test already exists

In [415]:
con.commit()

In [416]:
data = [('Atlanta','Georgia',1.25,6),
       ('Tallahassee','Florida',2.6,3),
       ('Sacramento','California',1.7,5)]

In [417]:
stmt = "INSERT INTO test VALUES(?,?,?,?)"

In [418]:
con.executemany(stmt,data)

OperationalError: database is locked

In [421]:
cursor = con.execute('select * from test')

In [422]:
rows = cursor.fetchall()

In [423]:
rows

[]

In [424]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [425]:
pd.DataFrame(rows,columns = [x[0] for x in cursor.description])

Empty DataFrame
Columns: [a, b, c, d]
Index: []

In [426]:
import sqlalchemy as sqla

In [427]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [428]:
pd.read_sql('select * from test' , db)

Empty DataFrame
Columns: [a, b, c, d]
Index: []